app/controllers/authorization_controller.rb

  def github
    client_id = ENV['GITHUB_CLIENT_ID']
    client_secret = ENV['GITHUB_CLIENT_SECRET']
    code = params['code']
    uri = URI("https://github.com/login/oauth/access_token?client_id=#{client_id}&client_secret=#{client_secret}&code=#{code}")

    res = Net::HTTP.start(uri.host, uri.port,
      :use_ssl => uri.scheme == 'https') do |http|
      request = Net::HTTP::Post.new uri

      response = http.request request
    end
    access_token = res.body.split("&")[0].split("=")[1]
    user = User.where(id: current_user.id).take
    user.update_attributes(github_access_token: access_token)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "github_access_token" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["github_access_token", "418c91672f74323129338e7bf3a3e41e97cecdf4"], ["updated_at", Wed, 15 Jan 2014 19:15:06 UTC +00:00]]