app/controllers/days_controller.rb

  def index
    @mentions = TwitterEntry.where(user_id: current_user.id, date: (Time.now - 1.day).to_s[0..9], kind: "mention")
---
SELECT "days".* FROM "days" WHERE "days"."user_id" = 1 LIMIT 1

  def show
    date = params[:id]
    mentions = TwitterEntry.where(user_id: current_user.id, date: date, kind: "mention")
    @mentions = mentions if !mentions.empty?
---
SELECT "twitter_entries".* FROM "twitter_entries" WHERE "twitter_entries"."day_id" = 1 AND "twitter_entries"."type" = 'tweet'