app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "rescue_time_key" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["rescue_time_key", "B63EMB8ooHFTiaqAOMRwE402lyzpfFGrYOuIfiue"], ["updated_at", Tue, 21 Jan 2014 13:17:33 UTC +00:00]]
---
  def rescue_time_update
    rescue_time_key = params['user']['rescue_time_key']
    User.where(id: current_user.id).take.update_attributes(rescue_time_key: rescue_time_key)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "wunderlist_token" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["wunderlist_token", "1c11bb5a1d59464caed085b6e31c03178bb52f5129f2fbcd96e62e0e19e18f80"], ["updated_at", Tue, 21 Jan 2014 17:25:24 UTC +00:00]]
---
  def wunderlist_update
    wunderlist_email = params['wunderlist_email']
    wunderlist_password = params['wunderlist_password']

    payload = { email: "#{wunderlist_email}", password: "#{wunderlist_password}" }.to_json
    response = wunderlist_login payload

    wunderlist_token = JSON.parse(response.body)['token']
    User.where(id: current_user.id).take.update_attributes(wunderlist_token: wunderlist_token)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "whatpulse_username" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["whatpulse_username", "hamchapman"], ["updated_at", Mon, 27 Jan 2014 23:59:28 UTC +00:00]]
---
  def whatpulse_update
    whatpulse_username = params['user']['whatpulse_username']
    User.where(id: current_user.id).take.update_attributes(whatpulse_username: whatpulse_username)